# Lab 4: Intro to Python, Pandas, and Margin of Errors

<a>
  <img src="images/census_worker_1920s_reddit.jpg" width='800' height='1000'>
  <div style='width: 1000px; text-align: left;'>Census bureau worker in the 1920s.</div>
</a>

In this lab you will be familiarizing yourself with the programming language called Python. Python is a so-called high level programming language. Which means it is very abstracted from machine languages and are easily readable by humans. 

Python is one of the most popular programming languages nowadays, and is used in various spheres from research and Data Science to Machine Learning and Artificial Intelligence.

In this lab you will also learn:  
1. **The basic data types in Python**  
2. **Import a datset into Python (using one of the most popular Python libraries: Pandas)**  
3. **Use built-in functions**  
4. **Estimate margins of error from your datasets!**

## <font color='red'> 1. Python's Data Types:
- Numerals
- Variables
- Strings
- Lists
- Arrays (more on arrays in lab 7)

### Numerals

One of the data types that is commonly used in Python are numerals (aka numbers). 
With numerals, Python can be used as a calculator. Run the cells below to see it for yourself.

In [1]:
3+5

8

In [2]:
140-20

120

In [3]:
40/2

20.0

In [4]:
2*2

4

Python follows the same arithmetic rules as we do. So guess what the output of the next cell will be:

In [5]:
2*5+1

11

What about this cell:

In [6]:
2*(5+1)

12

Guess what a double star notation does? Run the cell below to see if you had the right intuition about it.

In [7]:
3**2

9

There are a few types of them: **integers** and **floats**. 

They are not compatible, so it is important to remember which one you are using in order to avoid bugs. Floats use decimal points, so it will be easy for you to spot them. See how the output changes when we print the same number as an integer and as a float.

In [8]:
int(1776)

1776

In [9]:
float(1776)

1776.0

### Variables

To store the values in Python (and in many other programming languages) we need to use variables. Variables can store all kinds of information. This is useful if you plan to use the same values later on in your project. It will save you time and make your code more readable. To see how we store values in variables run the cell below.

In [30]:
burr = "Wait for it!"
burr

'Wait for it!'

If you don't assign any value to the variable and call it later, it will give you an error. We can see it in the cell below. (It will give you an error, but it was planned that way)

In [11]:
burr

'Wait for it!'

In [12]:
y = 8
z = x+y

NameError: name 'x' is not defined

Here, we did not assign x to anything, and since x was not defined, we cannot add its value to y, so this produces an error.

### Strings

The phrases and words in Python are always stored inbetween double or single quotation marks. They are formally called strings.

In [ ]:
"History has its eyes on you"

Also, you can use both single and double quotes for the strings, but sometimes you need to use single quotes inside of the string and that might cause a problem (it will "exit it out"). 

You can just always use the double quotation marks on the outside to avoid such problem. Or, you can use a backslash before the single quotation mark. It will tell Python to ignore it and not to exit it out. You can see an example of it below:

In [ ]:
print("What'd I miss")
print('You\'ll be back')

The strings can also be "added" onto one another. Run the cell below to see how it works.

In [ ]:
"York"+"town"

When we are using Jupyter Notebooks, the last line is printed out automatically (unless it is performing some other operation, eg. getting assigned to a specific value). But if you would like to print more than just the last line, you can use the print( ) method. If you just run the next cell, it will not give you any output.

In [ ]:
aaron = "Ev’ryone give it up for America’s favorite fighting Frenchman"
everyone = "Lafayette!"
mdl = "I’m takin this horse by the reins"

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
 Try using print( ) in the cell below to output all the three lines of lyrics of "Guns and Ships".  
    
 <b>Hint:</b>  you'll need to use it three times.
</div>

In [ ]:
### YOUR CODE HERE ###

A string is a sequence of characters. If you want to see how many characters your string has, use the len() method. Do you think spaces are considered characters in Python? Check if your intuition was correct by running the cell below.

In [ ]:
len(burr)

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
 Now create a variable name in which you will save your full name. Note that you need to call the variable once again in order to get an output.
</div>

In [ ]:
### YOUR CODE HERE ###
name = ...
name

Sometimes you need to switch the values in two variables. 
In the cell below we have the last names mixed up. The variable theodosia should have an output "burr" and philip should return "hamilton".
How would you approach this problem without manually retyping the outputs?

**Hint** Use a temporary variable in which you can temporarily save the value of one of the other variables.

In [ ]:
theodosia = "hamilton"
philip = "burr"

##fill these in, Version 1:
theodosia, philip = ...

# Version 2
temp = ...
theodosia = ...
philip = ...

### Lists

You have learned about the strings and numerals, it's time to take it up a notch. Another useful and very popular data type is a Python list.
Lists can take various data types (both numerals, strings, arrays, other lists, etc). 

To create an empty list just make your variable equal to "[ ]", like so:

In [ ]:
washington = []
washington

To add the values into your list you can either use lst.append( ), lst.insert( ), or lst.extend( ).

In [ ]:
washington.extend(["Right Hand Man"])
washington

In [ ]:
washington.insert(0, "I need my")
washington

In [ ]:
washington.append("Back")
washington

Notice, that the insert method takes two positional values. You need to specify the index in the list at which it will be inserted, whilst append just adds the value to the end of the list. 
extend takes another list as its input. If you try to use a string or a number by itself, it will give you an error.

When you need to access an element at a specific index, that is the code you can use The code below returns the second element of the list.

In [ ]:
washington[1]

**Note:** Python starts counting at 0, not 1.

Sometimes you just need to use part of the list. In this case you can use ":" to modify your list. Let's make a new list:

Sometimes you just need to use part of the list or copy the whole list into a new variable. In this
case you can use ":" to modify your list.
The notation is:

**a = b[start:stop:step]**

***start***: the index you want to start with. (the default is 0)

***stop***: the index you want to end with. (the default is the last number)

***step***: use it, if you wish to skip some indeces (eg. use only every other value). For example, if you start with index 1 and step is 2, you will iterate through the 1st index, then 3rd, then 5th, etc. until you get to the stopping index. (the default is 1)

Note that python will stop iterating at the value before the last index. See the following example:

In [ ]:
lst = [1,2,3,4,5]

In [ ]:
lst[0:5:1]

Note: if you wish to start iterating from the end of a list backwards, we use a negative step:

In [ ]:
lst[::-1]

In [ ]:
ham_songs = ["Alexander Hamilton", "Aaron Burr, Sir", "My Shot", \
             "The Story of Tonight", "The Schuyler Sisters", "Farmer Refuted",
             "You'll be Back", "Right Hand Man", "A Winter's Ball", \
             "Helpless", "Satisfied"]

every_other = ham_songs[::2] 
every_other

In [18]:
lyrics = ["I", "am", "not", "throwing", "away", "my", "shot"]
lyrics

['I', 'am', 'not', 'throwing', 'away', 'my', 'shot']

Let's say you want to save only the two last words from your old list into your new list. That's what you will need to do then:

In [24]:
alex = lyrics[-2:]
alex

# alternatively you can use lyrics[5:]

['my', 'shot']

Notice also that if you want to learn the length of your list, you can use the same method "len( )", but it will not count all the characters anymore. Instead, it will count all the elements in it. Like so:

In [ ]:
len(washington)

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
 Create a list with the values 1, 2, 3, 4, and 5 and only get the values 2 and 4
</div>

In [16]:
### YOUR CODE HERE ###
lst = [1,2,3,4,5]
lst
lst2=[lst[1], lst[3]]
lst2

[2, 4]

## <font color='red'> 2. Datasets (Using Pandas)

It is time for us to introduce a concept of Python libraries.
Libraries are the sets of different functions that you can import and use. The two most popular libraries are **numpy** and **pandas**.


Since we are using anaconda, a lot of libraries have been preloaded for you. You just need to "call" them. Just run the cell below. It will make our notebook know that we will be using these preinstalled libraries from that point on.

### Pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
# Now that you are familiar with all the basics of Python coding, 
# it is time for you to learn how to work with Tables and Pandas Data Frames. 
# First let's upload the dataset we have selected to work on, using the pd.read_csv command.

broadway = pd.read_csv("data/broadway.csv")

# Note that you can also read in excels: pd.read_excel('example.xlsx')
# You can read in most data types: just look up pandas read [insert file type]

# The dataset.head() comments will show you the top few rows of the table that you loaded in

broadway.head(10)

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
0,5500,88,26,08/26/1990,134456,0,8,Tru,8,Booth,Play,1990
1,1737,100,24,03/24/1991,100647,0,3,Miss Saigon,0,Broadway,Musical,1991
2,12160,100,31,03/31/1991,634424,0,3,Miss Saigon,0,Broadway,Musical,1991
3,13921,100,7,04/07/1991,713353,0,4,Miss Saigon,0,Broadway,Musical,1991
4,10973,90,14,04/14/1991,573981,0,4,Miss Saigon,4,Broadway,Musical,1991
5,14076,101,21,04/21/1991,706793,0,4,Miss Saigon,8,Broadway,Musical,1991
6,14065,101,28,04/28/1991,714968,0,4,Miss Saigon,8,Broadway,Musical,1991
7,14064,101,5,05/05/1991,730765,0,5,Miss Saigon,8,Broadway,Musical,1991
8,13896,100,12,05/12/1991,766713,0,5,Miss Saigon,8,Broadway,Musical,1991
9,13738,99,19,05/19/1991,763332,0,5,Miss Saigon,8,Broadway,Musical,1991

In [27]:
# We can call a column in our dataset by typing:
# It will return an array of values. Think of every column in a Pandas table as a vertical list.

broadway['Name']

0                             Tru
1                     Miss Saigon
2                     Miss Saigon
3                     Miss Saigon
4                     Miss Saigon
                   ...
31291                  The Humans
31292               The Lion King
31293    The Phantom Of The Opera
31294                    Waitress
31295                      Wicked
Name: Name, Length: 31296, dtype: object

In [7]:
# You can work with arrays like they are lists. For example, we can index into them to extract one value:

broadway['Attendance'][6]

14065

In [32]:
# Since columns are lists, you can do Python arithmetic on them! 
# For example, we can divide Attendance by 1000 to get Audience per 1000s:

broadway['Attendance'] / 1000

0         5.500
1         1.737
2        12.160
3        13.921
4        10.973
          ...
31291     7.234
31292    13.485
31293    10.966
31294     8.058
31295    13.804
Name: Attendance, Length: 31296, dtype: float64

In [8]:
# Another neat thing you can do with pandas is filter out certain values.
# For example, if you only wanted to see Broadway shows from 2016, you can do the following

shows_2016 = broadway[broadway.Year == 2016]
shows_2016

#Note: Here we created a new table called "shows_2016".

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
30225,7074,87,3,01/03/2016,518228,59,1,A View From The Bridge 2015,8,Lyceum,Play,2016
30226,15542,100,3,01/03/2016,2398110,105,1,Aladdin,9,New Amsterdam,Musical,2016
30227,6997,83,3,01/03/2016,552338,60,1,Allegiance,8,Longacre,Musical,2016
30228,11546,86,3,01/03/2016,1349303,92,1,An American In Paris,8,Palace,Musical,2016
30229,7857,96,3,01/03/2016,1042635,86,1,Beautiful,8,Stephen Sondheim,Musical,2016
...,...,...,...,...,...,...,...,...,...,...,...,...
31291,7234,87,14,08/14/2016,603770,62,8,The Humans,8,Schoenfeld,Play,2016
31292,13485,99,14,08/14/2016,2233894,97,8,The Lion King,8,Minskoff,Musical,2016
31293,10966,85,14,08/14/2016,999632,66,8,The Phantom Of The Opera,8,Majestic,Musical,2016
31294,8058,96,14,08/14/2016,990128,97,8,Waitress,8,Brooks Atkinson,Musical,2016
31295,13804,95,14,08/14/2016,1779664,100,8,Wicked,8,Gershwin,Musical,2016

In [33]:
# Similarly, we can use other booleans like <, >.
# We can look at the all the Broadway shows before the 2000s:

shows_90s = broadway[broadway.Year < 2000]
shows_90s

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
0,5500,88,26,08/26/1990,134456,0,8,Tru,8,Booth,Play,1990
1,1737,100,24,03/24/1991,100647,0,3,Miss Saigon,0,Broadway,Musical,1991
2,12160,100,31,03/31/1991,634424,0,3,Miss Saigon,0,Broadway,Musical,1991
3,13921,100,7,04/07/1991,713353,0,4,Miss Saigon,0,Broadway,Musical,1991
4,10973,90,14,04/14/1991,573981,0,4,Miss Saigon,4,Broadway,Musical,1991
...,...,...,...,...,...,...,...,...,...,...,...,...
5973,10128,79,26,12/26/1999,715999,82,12,The Phantom Of The Opera,8,Majestic,Musical,1999
5974,2939,34,26,12/26/1999,118985,27,12,The Price 99,8,Royale,Play,1999
5975,5028,63,26,12/26/1999,183612,56,12,The Rainmaker,8,Brooks Atkinson,Play,1999
5976,3673,34,26,12/26/1999,195192,29,12,The Scarlet Pimpernel,8,Neil Simon,Musical,1999
5977,3817,50,26,12/26/1999,243125,54,12,Waiting In The Wings,8,Walter Kerr,Play,1999

In [35]:
# Finally, we can also sort a table by a certain column. This can be really helpful for understanding a dataset!
# For example, we can sort by Gross revenue:

money = broadway.sort_values(by = 'Gross', ascending = False)
money

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
26997,17352,100,29,12/29/2013,3201333,121,12,Wicked,9,Gershwin,Musical,2013
25603,16281,100,30,12/30/2012,2947172,156,12,Wicked,9,Gershwin,Musical,2012
24057,17375,100,1,01/01/2012,2941794,133,1,Spider-Man Turn Off The Dark,9,Foxwoods,Musical,2012
30261,17119,99,3,01/03/2016,2940096,147,1,Wicked,9,Gershwin,Musical,2016
28626,16257,100,28,12/28/2014,2903309,154,12,Wicked,9,Gershwin,Musical,2014
...,...,...,...,...,...,...,...,...,...,...,...,...
13023,73,10,3,10/03/2004,3668,10,10,Marc Salem'S Mind Games,1,Lyceum,Special,2004
11749,49,448,23,11/23/2003,2478,4,11,Oldest Living Confederate Widow Tells All,1,Longacre,Play,2003
12541,51,716,30,05/30/2004,1929,5,5,Marc Salem'S Mind Games,1,Lyceum,Special,2004
4225,75,747,25,10/25/1998,1648,5,10,A Mom'S Life,1,Belasco,Special,1998
12509,24,337,23,05/23/2004,1037,3,5,Marc Salem'S Mind Games,0,Lyceum,Special,2004

**What are some interesting takeaways from the previous table?**

<div class="alert alert-success" style="font-size:120%">
<b>YOUR TURN</b>: <br>
Ask a question about this dataset that you can solve using the commands we've learned above.
</div>

In [ ]:
### YOUR CODE HERE ###

**How to know what data type are we talking about?**

In [37]:
lyrics

['I', 'am', 'not', 'throwing', 'away', 'my', 'shot']

In [21]:
type(lyrics)

list

In [38]:
"CP101"

'CP101'

In [22]:
type("CP101")

str

In [39]:
broadway.head()

,Attendance,Capacity,Day,Full,Gross,Gross Potential,Month,Name,Performances,Theatre,Type,Year
0,5500,88,26,08/26/1990,134456,0,8,Tru,8,Booth,Play,1990
1,1737,100,24,03/24/1991,100647,0,3,Miss Saigon,0,Broadway,Musical,1991
2,12160,100,31,03/31/1991,634424,0,3,Miss Saigon,0,Broadway,Musical,1991
3,13921,100,7,04/07/1991,713353,0,4,Miss Saigon,0,Broadway,Musical,1991
4,10973,90,14,04/14/1991,573981,0,4,Miss Saigon,4,Broadway,Musical,1991

In [26]:
type(broadway)

pandas.core.frame.DataFrame

In [27]:
type(5)

int

In [28]:
type(5.4)

float

In [35]:
type(broadway['Name'])

pandas.core.series.Series

In [36]:
type(broadway['Name'][0])

str

## <font color='red'>3. Functions

Although Python doesn't have a lot of functions and methods by itself, it is not like it doesn't have any. Let's go over some of the most valuable built-in funsctions in Python.

In [9]:
min(1, 3)

1

In [10]:
max(15, 25, 70)

70

You can also use these functions with strings. Can you guess what the output will be?

In [11]:
max("Hamilton", "Washington")

'Washington'

So does Python know that George Washington was older than Alexander Hamilton? Of course not, when comparing strings, Python goes of off the letters of alphabet. Since "W" goes after "H" in the alphabet, "Washington" is a value that is "bigger" than "Hamilton".

We have created two lists with different integers. Let's now find the biggest number among the two smallest numbers in two lists. In other words, let's find the max( ) of the two min( ). You can achieve it with either 3 or 1 lines of code.

In [ ]:
dob = [1757, 1756, 1732, 1737, 1754]
dod = [1804, 1836, 1799, 1793, 1782] 

##fill in
min_dob = ...
min_dod = ...
max_of_mins = ...


# you can do it in one line

max_mins = max(min(), min())

Another valuable function you can use with your numerals is "round". It will round your floats to the nearest integer. Like so:

In [ ]:
round(8.7)

Another useful function we can use with numbers is "abs". It outputs an absolute value of a number:

In [ ]:
abs(-3.5)

## <font color='red'>4. Margins of Error (MoEs) in Python

It often makes sense to congregate census categories. For example, in the Excel sheet “Ages” in the workbook “Lab4Data.xlsx” you will find the education information for Census Tract 4004. The information separates the population into 6 age categories. This may be more than we need for the purposes of our analysis, so we are going to consolidate the information into three categories, “Child”, “Working Age Adult”, and “Senior Adult”.

Here is the data we'll be loading in. Don't worry too much about this code—we are importing data from an Excel spreadsheet into a Pandas DataFrame, and then dropping some redundant columns.

In [27]:
data = pd.read_excel('Lab4Data.xlsx')
data = data.drop(columns = data.columns[[1, 3, 4]])
data

                   AGE  Estimate Margin of Error
0        Under 5 years       257          +/-101
1        5 to 17 years       421          +/-125
2       18 to 34 years      1241          +/-204
3       35 to 64 years      1569          +/-140
4       65 to 74 years       329           +/-77
5    75 years and over       169           +/-59

### Aggregating Age

Let’s create a new column for each of our new categories, and a column for our new categories’ MOEs. Then let’s congregate our categories by summing estimates across categories. “Child” will include “Under 5 years” and “5 to 17 years”. “Working Age Adult” will include “18 to 34 years” and “35 to 64 years”. “Senior Adult” will include “65 to 74 years” and “75 years and over”.

In [29]:
# To do this, lets make a new data frame:
aggregated = pd.DataFrame()
aggregated['Age Categories'] = ['Child', 'Working Age Adult', 'Senior Adult']
aggregated['Estimate'] = [sum(data.Estimate[0:2]), sum(data.Estimate[2:4]), sum(data.Estimate[4:])]
aggregated

      Age Categories  Estimate
0              Child       678
1  Working Age Adult      2810
2       Senior Adult       498

### Aggregating Margins of Error

To calculate the MOE for aggregated count data:
1. Obtain the MOE of each individual estimate.
2. Square the MOE of each estimate.
3. Sum the squared MOEs.
4. Take the square root of the sum of the squared MOEs.

We've written a function called `MOE` that does these steps for us. Make sure you understand how it works!

In [31]:
# this is a function to calculate MOE

def MOE(arr):
    sq = arr**2
    return np.sqrt(sum(sq))

We can apply the function specifically on the rows corresponding to the "Child" age group, which are the first two rows of our `data`. Remember that when slicing lists, and arrays, the second term is exclusive.

In [33]:
# Apply the function above on an array of MOE's you want to aggregate
# For example: age group Child.

agg_moe_child = MOE(data['Estimate'][0:2])
agg_moe_child

493.24436134638177

Now, do the same for the "Working Age Adult" and "Senior Adult" categories!

In [36]:
agg_moe_adult = ... #FILL IN 
agg_moe_senior = ... #FILL IN

The cell below puts our calculated `agg_moe_child`, `agg_moe_adult`, `agg_moe_senior` into an array, and then adds that array as a column to our `aggregated` DataFrame.

In [37]:
# Run this cell to produce and view your final aggregated table!
aggregated['MOE'] = np.array([agg_moe_child, agg_moe_adult, agg_moe_senior])
aggregated

      Age Categories  Estimate       MOE
0              Child       678   493.244
1  Working Age Adult      2810  Ellipsis
2       Senior Adult       498  Ellipsis

Finally, you can run this line that will output the aggregated table to a .csv file, so you can use it in other programs!

In [38]:
aggregated.to_csv('Lab4Agg.csv')